package edu.kit.wavelength.client.view.export;

import java.util.ArrayList;
import java.util.Arrays;

public class ArrowFactory {

	private static ArrayList<String> arrows = new ArrayList(Arrays.asList("➥", "b"));
	
	
	"→⮕➡↣⇾⇝⟿↠⇸⇻⤀⤁⤔⤕⤅⤖⤐⤗⤘⤞⤠↳⤷⥂⥱⥸⭈⥵⭇⥲⭌⥴⥅⥹⇴⥇⟴⭃⭄↯⤳⇀⇁⥋⥓⥗⥛⥟⥤⥬⥭⇢⤍⤏⤑⇉⇶⇒⇍ ⇏ ⇎ ⟸ ⟹ ⟺  ⤂ ⤃ ⤄ ⤆ ⤇  ⇚ ⇛ ⤊ ⤋ ⭅ ⭆ ⟰ ⟱
	Arrow with Bar
	↤ ↦ ↥ ↧  ⟻ ⟼  ⇤ ⇥ ⤒ ⤓ ↨
	Special Tail Arrows
	⤙ ⤚ ⤛ ⤜  ↩ ↪ ↫ ↬  ⥼ ⥽ ⥾ ⥿
	CLOCKWISE, ANTICLOCKWISE
	⤼ ⤽  ↶ ↷ ⤾ ⤿ ⤸  ⤺ ⤹ ⤻  ↺ ↻ ⥀ ⥁ ⟲ ⟳  🗘 ⮍ ⮌ ⮏ ⮎ ⮔ 🔁 🔂 🔃 🔄
	Shaded/Shadow
	➩ ➪ ➫ ➬ ➭ ➮ ➯ ➱ 🢠 🢡 🢢 🢣 🢤 🢥 🢦 🢧 🢨 🢩 🢪 🢫
	Decorative Arrows
	⇪ ⇫ ⇬ ⇭ ⇮ ⇯  ➳ ➵ ➴ ➶ ➸ ➷ ➹  ➙ ➘ ➚  ➾ ⇰ ➛ ➜ ➔ ➝ ➞ ➟ ➠ ➥ ➦ ➧ ➨ ➲  ➢ ➣ ➤ ➺ ➻ ➼ ➽
	Pointers and Triangles
	◄ ► ◅ ▻  ◀ ▶ ▲ ▼
	Arrow Head, Arrow Shaft
	🢐 🢒 🢑 🢓  ⌃ ⌄  🢔 🢖 🢕 🢗  🢜 🢝 🢞 🢟 🢬 🢭  ⮹
	More
	🔙 🔚 🔛 🔜 🔝  🠴 🠶 🠵 🠷  🠼 🠾 🠽 🠿  🡀 🡁 🡂 🡃 🡄 🡆 🡅 🡇  🠹 🠻 🠸 🠺  🢘 🢚 🢙 🢛  🠀 🠂 🠁 🠃  🠄 🠆 🠅 🠇 🠈 🠊 🠉 🠋  🠐 🠒 🠑 🠓  🠔 🠖 🠕 🠗  🠘 🠚 🠙 🠛  🠜 🠞 🠝 🠟 🠠 🠢 🠱 🠳 🠤 🠦 🠨 🠪 🠬 🠮 🠰 🠲"
}
